app/Controllers/APIController.php

    public function NewDetails()
    {

        Header('Access-Control-Allow-Origin: *'); //for allow any domain, insecure
        Header('Access-Control-Allow-Headers: *'); //for allow any headers, insecure
        Header('Access-Control-Allow-Methods: GET, POST'); //method allowed


        $id = $this->request->getVar('id');

//        return $this->respond(array('id'=>$id), 200);
//        exit;

        if(isset($id))
        {
            $News = new News();
            $res = $News->find($id);
---
SELECT *
FROM `news`
WHERE `news`.`id` = '4'