app/Controllers/Contact.php

        );

        $ContactModel = new ContactForm();
        if($ContactModel->insert($insertdata))
---
INSERT INTO `contact_form` (`name`, `email`, `phone`, `office_phone`, `company`, `city`, `message`, `created_at`) VALUES (NULL, NULL, NULL, NULL, NULL, NULL, NULL, '22-04-03 02:00:35')