app/Controllers/News.php

SELECT *
FROM `news`
 LIMIT 3
---
    public function show($limit = null)
    {

        Header('Access-Control-Allow-Origin: *'); //for allow any domain, insecure
        Header('Access-Control-Allow-Headers: *'); //for allow any headers, insecure
        Header('Access-Control-Allow-Methods: GET, POST'); //method allowed

        $News = new \App\Models\News();
        if($limit != null)
        {
            $res = $News->findAll($limit);